posts/2020-08-09-portable-scripts/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shared Scripts on Windows and Linux</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Shared Scripts on Windows and Linux</h1>
</header><p>
Sometimes you end up in a situation where you would like to use the same script
on different operating systems (e.g. Linux and Windows). Now you have to choose
between two possibilities:
</p>

<ul class="org-ul">
<li>Write the same script in different languages (e.g. Bash and PowerShell)</li>
<li>Write your script in one language and ensure that you can use it on all
systems (e.g. by using PowerShell Core)</li>
</ul>

<p>
I've recently experimented with the second approach. But which portable language
should one use? Well, I went down the crazy road and opened up my good old
friend Emacs. Let's start with two Bash examples:
</p>

<p>
A script to run <code>git pull</code> in several directories:
</p>

<div class="org-src-container">
<pre class="src src-sh">#!/bin/bash -eu

repositories=(~/.emacs.d/ ~/Projects/*/)

for repo in ${repositories[*]}
do
    echo "Pulling '$repo'"
    pushd "$repo" &gt; /dev/null
    git pull
    popd &gt; /dev/null
done
</pre>
</div>

<p>
And a simple <code>rsync</code> backup script:
</p>

<div class="org-src-container">
<pre class="src src-sh">#!/bin/bash -eu

dest=/some/backup/location

rsync="rsync -avh --delete"

$rsync ~/Documents "$dest"
$rsync ~/Projects "$dest"
</pre>
</div>

<p>
Now let's rewrite these scripts in Lisp. Here's the <code>git</code> script (which relies
on the <code>magit</code> package):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun fw/git-pull-all ()
  "Runs git pull for every repository found in `magit-list-repos'"
  (interactive)
  (require 'magit)
  (if magit-repository-directories
      (dolist (path (magit-list-repos))
        (let ((default-directory path))
          (let ((exit-code (fw/exec-app "git" (list "pull" path))))
            (unless (eq exit-code 0)
              (user-error "Error while pulling \"%s\"" path)))))))
</pre>
</div>

<p>
And the <code>rsync</code> script:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun fw/rsync (&amp;rest args)
  "Calls the rsync binary"
  (fw/exec-app-validated "rsync" args '(0)))

(defun fw/rsync-backup ()
  "Creates my rsync backup"
  (interactive)
  (let ((destination "/some/backup/location")
        (directories '("~/Documents"
                       "~/Projects")))
    (dolist (directory directories)
      (fw/rsync "-avh --delete" directory destination))))
</pre>
</div>

<p>
The above snippets rely on these helper functions:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun fw/exec-app (application args)
  "Runs an `application' with a list of `args' using
`shell-command' and returns the exit code"
  (let ((shell-command-dont-erase-buffer t)
        (full-cmd (string-join (add-to-list 'args application) " ")))
    (shell-command full-cmd (concat "*exec " application "*"))))

(defun fw/exec-app-validated (application args valid-exit-codes)
  "Runs an `application' with a list of `args' using
`shell-command' and throws a `user-error' if the exit code is not
a member of the `valid-exit-codes' list"
  (let ((exit-code (fw/exec-app application args)))
    (unless (member exit-code valid-exit-codes)
      (user-error "Exit code of \"%s\" was %s" application exit-code))))
</pre>
</div>

<p>
It was fun to come up with the above solutions, but for the most part I'll
rewrite my scripts depending on which operating system I'm on. While Emacs has
become a big part of my daily computer work, I'm still not convinced that this
tool should be utilized everywhere.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2020-08-09</p>
<footer>
<p>© 2025 Florian Winkelbauer</p>
</footer>
</div>
</body>
</html>
